# DS_GetAngle

## Description
Returns document shadow angle.

```pascal
FUNCTION DS_GetAngle : REAL;
```

```python
def vs.DS_GetAngle():
    return REAL
```

## Version
Availability: from Vectorworks 2014

## Category
* Document Attributes